Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་རླུང་གི་སྟོབས་དང་མཉམ་པའི་ཤུགས་ཅན་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་འུར་འུར་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་རྔ་བོ་ཆེ་དང་ཅང་ཏེའུ་ཡི་སྒྲ་ལྟར་དིར་དིར་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ཀླུའི་སྟོབས་དང་དྲེགས་པ་འཇོམས་པ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་སང་སང་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་འོད་ཆེན་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་གཤོག་ཟེགས་བཀྲམ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་བུད་རྒྱལ་གདོང་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་རིག་སྔགས་ཀྱི་ནོར་བུ་སིལ་སིལ་འཆང་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུའི་རིགས་གཞིག་པར་དགའ་བ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུའི་རིགས་རབ་ཏུ་འཇོམས་པར་དགའ་བ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ཡང་དག་པར་མཐོང་བ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་བྱམས་པ་ཆེན་པོའི་ཚིག་སྙན་པར་སྒྲོགས་པ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ཆོས་དགའ་ཞེས་བྱ་བ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་གསེར་གྱི་གཤོག་པ་སྦྱིན་ཞེས་བྱ་བ་དང་།
en: They included the garuḍa king Forceful Wind That Equals the Strength of a Great Mighty Elephant, the garuḍa king Roaring Wind, the garuḍa king Rumbling Like Drums, the garuḍa king Defeating the Haughty Powerful Nāgas, the garuḍa king Lustrous, the garuḍa king Great Brilliance, the garuḍa king Spreading Spotted Wings, the garuḍa king Bee-King Face, the garuḍa king Bearing the Cymbals of the Jewel of Knowledge, the garuḍa king Enjoys Utterly Defeating the Clan of the Nāga King Vast Wealth, the garuḍa king Enjoys Subjugating the Clan of the Nāga King Vast Wealth, the garuḍa king Authentic Perception, the garuḍa king Pleasing Proclamation of Great Loving-Kindness, the garuḍa king Dharma Joy, and the garuḍa king Golden Wing Offering.

source: དེ་དག་ལ་སོགས་པ་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བཞི་དང་དགུ་འབུམ་སྟེ། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲེགས་པ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་བྲལ་བ་དང་།
en: These garuḍa kings, numbering four million nine hundred thousand, were all free from haughtiness, pride, and conceit.

source: ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་སེམས་ཐོབ་པ། དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བར་གྱུར་པ་ཤ་སྟག་སྟེ།
en: They had all given rise to devotion toward the Great Vehicle and had become sole protectors of the excellent Dharma.

source: ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they prostrated, touching their heads to the Bhagavān’s feet, and sat down to one side.

source: ཡང་དེའི་ཚེ་དྲི་ཟའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་དྲུག་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། དྲི་ཟའི་རྒྱལ་པོ་དགའ་བའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་གདངས་སྙན་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་སྟ་གོན་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཁྱུ་མཆོག་ལྷ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཤུགས་ཀྱིས་འཁྱིག་པར་ལེན་པ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཤང་ཤང་ཏེའུ་ཡི་སྐད་འབྱིན་ཅེས་བྱ་བ་དང་།
en: Also, at that time, there were six million eight hundred thousand gandharva kings, including the gandharva king Essence of Joy, the gandharva king Melody, the gandharva king Enjoys Preparation, the gandharva king Foremost of Gods, the gandharva king Enjoys Seizing by Force, and the gandharva king Jīvañjīva’s Cry.

source: དེ་དག་ལ་སོགས་པ་དྲི་ཟའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་དྲུག་དང་བརྒྱད་འབུམ་སྟེ། དྲི་ཟའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲེགས་པ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་བྲལ་བ།
en: These gandharva kings, numbering six million eight hundred thousand, were all free from haughtiness, pride, and conceit.

source: ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་མི་འམ་ཅིའི་རྒྱལ་པོ་ཆེན་པོ་ས་ཡ་ཕྲག་དགུ་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། མི་འམ་ཅིའི་རྒྱལ་པོ་ལེགས་མཐོང་ཡིད་འཕྲོག་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་ཀླུ་ཁྱེར་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་བུད་མེད་སེམས་འཕྲོག་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་བུད་མེད་ཀྱི་སྙིང་དུ་སྡུག་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་ལྷའི་བུ་མོ་ལ་འབོད་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་ཉོན་མོངས་པ་རྐུ་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་དགྲ་རིག་དྲེགས་འཇོམས་གསོད་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་བདུད་ཀྱི་བུ་མོ་དགའ་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་བདུད་ཀྱི་སྡེ་འཇོམས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་ཡེ་ཤེས་སྙིང་པོ་ཞེས་བྱ་བ་དང་། མིའམ་རྒྱལ་པོ་ཟབ་མོའི་ཚུལ་བསྒོས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་དྲི་མ་མེད་པར་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་དབང་པོ་བསྲུངས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་རྒྱང་རིང་མཐོང་ཞེས་བྱ་བ་དང་།
en: At that time, there were also nine million eight hundred thousand kinnara kings, including the kinnara king Beautiful and Charming, the kinnara king Nāga City, the kinnara king Ravishing Women’s Minds, the kinnara king Pleasing to Women’s Hearts, the kinnara king Lusts after Goddesses, the kinnara king Thief of Afflictions, the kinnara king Killer of Haughty Obstructers, the kinnara king Enjoys Māra’s Daughters, the kinnara king Subduer of Māra’s Armies, the kinnara king Essence of Gnosis, the kinnara king Profound Instruction, the kinnara king Glory of Stainless Appearance, the kinnara king Guards the Senses, and the kinnara king Far Seeing.

source: དེ་དག་ལ་སོགས་པ་མི་འམ་ཅིའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་དགུ་དང་བརྒྱད་འབུམ་སྟེ། མི་འམ་ཅིའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲེགས་པ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་བྲལ་བ།
en: These kinnara kings, numbering nine million eight hundred thousand, were all free from haughtiness, pride, and conceit.

source: ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་སེམས་ཐོབ་པ། དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བར་གྱུར་པ་ཤ་སྟག་སྟེ། ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: They had all given rise to devotion toward the Great Vehicle and had become sole protectors of the excellent Dharma. After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་སྲིན་པོའི་རྒྱལ་པོ་ས་ཡ་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། སྲིན་པོའི་རྒྱལ་པོ་འཇིགས་སུ་རུང་བ་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་རྩིབ་མ་སྲེག་ཅེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་དྲང་སྲོང་ཟས་ལེན་སྐྲ་སེར་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་སོ་རད་རོད་ཅན་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་རྣ་བཅས་ཐོད་པ་ཅན་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་སེར་པོ་སྦྲང་རྩིའི་མདོག་ཅེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་མགུལ་ངར་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་སྒྲ་བོ་ཆེ་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་མགོ་ཟེད་ཅེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་གྱད་ལ་སྐུལ་ཞེས་བྱ་བ་དང་། སྲིན་པོའི་རྒྱལ་པོ་སྐྲག་བྱེད་གཟུགས་ཅན་ཞེས་བྱ་བ་དང་།
en: At that time, there were also one million eight hundred thousand rākṣasa kings, including the rākṣasa king Deserving of Fear, the rākṣasa king Rib Roaster, the rākṣasa king Golden-Haired Devourer of Ṛṣis, the rākṣasa king Crooked Teeth, the rākṣasa king Skull Cup with Ears, the rākṣasa king Yellow Honey-Color, the rākṣasa king Strong Throat, the rākṣasa king Great Roar, the rākṣasa king Cleaved Head, the rākṣasa king Arousing Strength, and the rākṣasa king Frightening Form.

source: དེ་དག་ལ་སོགས་པ་སྲིན་པོའི་རྒྱལ་པོ་ས་ཡ་དང་བརྒྱད་འབུམ་སྟེ། སྲིན་པོའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་སྲིན་པོའི་རང་བཞིན་དང་བྲལ་བ། ཐེག་པ་ཆེན་པོས་སེམས་དུལ་བར་གྱུར་པ།
en: These rākṣasa kings, numbering one million eight hundred thousand, were all freed from the nature of rākṣasas, their minds having been tamed by the Great Vehicle.

source: དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བར་གྱུར་པ་ཤ་སྟག་སྟེ།
en: They were all sole protectors of the excellent Dharma.

source: ཡང་དེའི་ཚེ་གྲུལ་བུམ་གྱི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བདུན་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། གྲུལ་བུམ་གྱི་རྒྱལ་པོ་གླང་པོ་ཆེའི་རྣ་བ་ཅན་ཞེས་བྱ་བ་དང་། གྲུལ་བུམ་གྱི་རྒྱལ་པོ་སྟག་ལྟར་དྲེགས་པ་ཞེས་བྱ་བ་དང་། གྲུལ་བུམ་གྱི་རྒྱལ་པོ་ཤིན་ཏུ་ཆེ་བ་ཞེས་བྱ་བ་དང་།
en: At that time, there were also seven million eight hundred thousand kumbhāṇḍa kings, including the kumbhāṇḍa king Great Elephant’s Trunk, the kumbhāṇḍa king Tiger-Like Haughtiness, and the kumbhāṇḍa king Extremely Great.

source: དེ་དག་ལ་སོགས་པ་གྲུལ་བུམ་གྱི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བདུན་དང་བརྒྱད་འབུམ་སྟེ། གྲུལ་བུམ་གྱི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་གྲུལ་བུམ་གྱི་རང་བཞིན་དང་བྲལ་བ། དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བར་གྱུར་པ་ཤ་སྟག་སྟེ། ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: These kumbhāṇḍa kings, numbering seven million eight hundred thousand, were all freed from the nature of kumbhāṇḍas and had become sole protectors of the excellent Dharma. After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཡང་དེའི་ཚེ་འབྱུང་པོའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གསུམ་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: འབྱུང་པོའི་རྒྱལ་པོ་གླང་པོ་ཆེའི་གདོང་ཅན་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་མྱུ་གུ་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་ཁྱིམ་འབིགས་རྐུན་པོ་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་བོད་སྐད་ཅན་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་མེ་ཏོག་གི་རྣ་ཆ་ཅན་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་སྦལ་ཕྲེང་སོར་རྡུབ་ཅན་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་བྱི་སོ་མཛེས་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་བྱི་ལ་འགྲོས་མཛེས་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་སྲེ་མོ་འགྲམ་ཞེས་བྱ་བ་དང་། འབྱུང་པོའི་རྒྱལ་པོ་སྤྲ་བཞིན་ཟླ་བ་གདོང་ཞེས་བྱ་བ་དང་།
en: At that time, there were also three million eight hundred thousand bhūta kings, including the bhūta king Great Elephant Face, the bhūta king Tumor, the bhūta king House-Tunneling Robber, the bhūta king Donkey’s Bray, the bhūta king Flower Earrings, the bhūta king Strung-Frog Rings, the bhūta king Adorned with Rat Teeth, the bhūta king Adorned with Cat’s Gait, the bhūta king Weasel Jaws, and the bhūta king Langur-Like Moon Face.

source: དེ་དག་ལ་སོགས་པ་འབྱུང་པོའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གསུམ་དང་བརྒྱད་འབུམ་སྟེ།
en: These bhūta kings, numbering three million eight hundred thousand, were all filled with devotion and delight toward the Great Vehicle alone.

source: འབྱུང་པོའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་སེམས་དད་ཅིང་རབ་ཏུ་དགའ་བ་ཤ་སྟག་སྟེ། གར་བྱེད་ཅིང་རོལ་མོའི་སྒྲ་སྒྲོགས་ལ་སིལ་སྙན་རྣམས་རྡོབ་ཅིང་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Striking cymbals that played melodious sounds, inciting others to dance, after noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བརྒྱད་ལ་འདི་ལྟ་སྟེ། གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་གློག་ཞི་བྱེད་བཙུན་ཞེས་བྱ་བ་དང་། གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་སྣ་ཚོགས་སྔོ་བཙུན་ཞེས་བྱ་བ་དང་། གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་བྱ་མཆུ་ཅན་ཞེས་བྱ་བ་དང་། གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འཁྲུག་བྱེད་ཅེས་བྱ་བ་དང་།
en: At that time, there were also eight million preta kings, including the preta king Lightning-Pacifying Venerable, the preta king Various Herbs Venerable, the preta king Bird’s Beak, and the preta king Ocean Stirrer. These preta kings, numbering eight million, all fully enjoyed themselves within the Great Vehicle;

source: དེ་དག་ལ་སོགས་པ་གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བརྒྱད་དེ། གཅོད་བྱེད་ཀྱི་བུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་རྩེ་བ། ཐེག་པ་ཆེན་པོ་ལ་སེམས་མངོན་པར་རབ་ཏུ་དགའ་བ། ཐེག་པ་ཆེན་པོ་མངོན་པར་འདོད་པ། ཐེག་པ་ཆེན་པོས་མངོན་པར་སྐོམ་པ། ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་སྲེད་པ། ཐེག་པ་ཆེན་པོ་ལ་དད་པ། ཐེག་པ་ཆེན་པོས་བཀྲེས་པ།
en: their minds manifesting utter joy toward the Great Vehicle, they desired the Great Vehicle, thirsted after the Great Vehicle, craved the Great Vehicle, devoted themselves to the Great Vehicle, and hungered for the Great Vehicle.

source: དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བར་དམ་བཅས་པ། དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་བར་ཡོངས་སུ་འཛིན་པའི་ངང་ཚུལ་ཅན་ཤ་སྟག་སྟེ།
en: They had vowed to fully protect the excellent Dharma and solely engaged in the conduct of fully supporting all protectors of the excellent Dharma.

source: ཡང་དེའི་ཚེ་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་བརྒྱད་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ཐག་ཟངས་རིས་ཀྱི་མདུན་ན་སྒྲ་སྒྲོགས་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ཡུལ་གྱིས་གཡོན་སྤྱོ་བ་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་གང་གཱ་དྲི་མ་མེད་པར་འཇུག་པ་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ས་སྟེང་ཞི་བྱེད་ཅེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་བྱ་མགྲིན་ཅེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་མདུང་རྩེ་གསུམ་པ་འཆང་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ཐལ་བའི་གཙུག་ཕུད་ཅན་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་གཏུམ་པོ་དྲག་ཏུ་ཁྲོ་བ་ཞེས་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་མེའི་གཟི་བརྗིད་ཀྱི་ཤུགས་ཅན་ཞེས་བྱ་བ་དང་།
en: At that time, there were also eighty million eight hundred thousand asura kings, including the asura king Roaring in Front of King Splendid Robe, the asura king Reviled by the Land, the asura king Entering into Ganges Stainlessness, the asura king Earth Pacifier, the asura king Bird Throat, the asura king Trident Holder, the asura king Ashen Locks, the asura king Fiercely Wrathful Ferocious One, and the asura king Power of Blazing Fire.

source: དེ་དག་ལ་སོགས་པ་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བརྒྱད་དང་བརྒྱད་འབུམ་སྟེ། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷ་མ་ཡིན་གྱི་རང་བཞིན་དང་བྲལ་བ། སེམས་དུལ་བ། ཡིད་རབ་ཏུ་བརྟན་པ་ཤ་སྟག་སྟེ།
en: These asura kings, numbering eighty million eight hundred thousand, were all freed from the nature of asuras, having tamed and utterly controlled their minds.

source: ཡང་དེའི་ཚེ་རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་ས་ཡ་ཕྲག་དྲུག་དང་ལྔ་འབུམ་ལ་འདི་ལྟ་སྟེ། རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་རིན་ཆེན་འཆང་ཞེས་བྱ་བ་དང་། རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་ལོངས་སྤྱོད་མི་ཟད་འཆང་ཞེས་བྱ་བ་དང་།
en: At that time, there were also six million five hundred thousand vidyādhara kings, including the vidyādhara king Holder of Great Jewels and the vidyādhara king Holder of Inexhaustible Enjoyments.

source: དེ་དག་ལ་སོགས་པ་རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་ས་ཡ་ཕྲག་དྲུག་དང་ལྔ་འབུམ་སྟེ། རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་འཆང་བ།
en: These vidyādhara kings, numbering six million five hundred thousand, were all holders of the Great Vehicle.

source: ཏིང་ངེ་འཛིན་འདོད་པ། ཏིང་ངེ་འཛིན་ཚོལ་བར་འདོད་པ།
en: They desired and sought after samādhi;

source: ཐེག་པ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་པ་སྤྱད་པར་འདོད་པ།
en: they desired to engage in the practice of the samādhis of the Great Vehicle;

source: བདག་གི་ཡིད་གཉིས་བསལ་བར་འདོད་པ།
en: and they desired to clear away their own ambivalence.

source: དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་བར་ཡོངས་སུ་འཛིན་པའི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཅན་ཤ་སྟག་སྟེ།
en: They solely engaged in the discipline and ascetic practice of fully supporting all protectors of the excellent Dharma.

source: ཡང་དེའི་ཚེ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པ། ས་ཡ་ཕྲག་དགུ་དང་དགུ་འབུམ་ལ་འདི་ལྟ་སྟེ། དྲང་སྲོང་མིས་བྱིན་གྱི་བུ་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཏེ་མ་བུ་ཀ་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཤིང་ཤུན་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་དཀའ་ཐུབ་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཡང་དག་སྦྱོར་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཀུན་ཏུ་རྒྱལ་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ངན་སྤོང་ཤེས་ལྡན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་རི་བྱི་རངས་བྱེད་གཞུ་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་མ་མ་རི་དགས་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཤ་མེད་ཟས་སྦྱིན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་གནས་འཇོག་སེལ་བརྩོན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་སྒྲ་མི་སྙན་ལྔ་ལེན་རིལ་པ་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་འདོད་པ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་དུས་དང་པོ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་བརྒྱ་བྱིན་ལྷར་འཛིན་ཡུན་རིང་གནས་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་མཛོད་ལྡན་སྒྲ་མི་སྙན་ཅེས་བྱ་བ་དང་། དྲང་སྲོང་བྷ་ར་དྭ་ཛ་ཤིང་ཤུན་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་ཀླུའི་རིལ་པ་ཅན་ཞེས་བྱ་བ་དང་། དྲང་སྲོང་འདམ་བུས་བྱིན་ཞེས་བྱ་བ་དང་།
en: At that time, there were also nine million nine hundred thousand ṛṣis who had obtained the five superknowledges, including the ṛṣi Son of Nārada, the ṛṣi Stopper, the ṛṣi Tree Bark, the ṛṣi Ascetic, the ṛṣi Correct Practice, the ṛṣi All Conquering, the ṛṣi Understands the Renunciation of Negativity, the ṛṣi Agasti the Holder of Rāma’s Bow, the ṛṣi Deer Mother, the ṛṣi Meatless Food Offering, the ṛṣi Aspiring to Leave Behind the Sanctuary, the ṛṣi Holder of Sacred Water Who Accepted the Five Kauravas, the ṛṣi Leaving Behind Desire, the ṛṣi Delighting in the First Time, the ṛṣi Abiding Long as Indra, the ṛṣi Treasury-Possessing Kaurava, the ṛṣi Bharadvaja-Tree Bark, the ṛṣi Holder of Sacred Nāga Water, and the ṛṣi Gift of the Swamp.

source: དེ་དག་ལ་སོགས་པ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པ་ས་ཡ་ཕྲག་དགུ་དང་དགུ་འབུམ་སྟེ། ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: These ṛṣis who had obtained the five superknowledges, numbering nine million nine hundred thousand, set forth from their respective abodes after noon and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་བུའི་ཚོགས་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there was also Śakra, Lord of the Devas, and the host of devaputras from the Heaven of the Thirty-Three, numbering in the hundreds of thousands. They set forth from their respective abodes after noon and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Having arrived there, they all prostrated, touching their heads to his feet.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་འཇིག་རྟེན་སྐྱོང་བ་བཞི་ལྷའི་བུ་འབུམ་ཕྲག་དུ་མས་མདུན་གྱིས་བལྟས་ཏེ་ཡོངས་སུ་བསྐོར་ནས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, the Four World Guardians, attended and surrounded by hundreds of thousands of devaputras, set forth from their respective abodes after noon and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཡང་དེའི་ཚེ་ཡུལ་མཉན་ཡོད་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་རང་གི་བློན་པོ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་རྩེ་བ་དེ་དང་དེ་དག་རང་རང་གི་འཁོར་དང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དག་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Having arrived there, they prostrated, touching their heads to the Bhagavān’s feet, and sat down to one side. At that time, King Prasenajit, the ruler of Kośala, came from Śrāvastī in his great royal chariot with his great ministers and their retinues, together with the entire army in its four divisions. After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་རབ་སྦྱིན་ལ་སོགས་པ་ཁྱིམ་བདག་འབུམ་ཕྲག་དུ་མ་བསླབ་པའི་གཞི་ལྔ་བླངས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: At that time, there were also hundreds of thousands of householders who had received the five precepts, including Sudatta and others. All of them had set out toward unsurpassed, complete, and perfect awakening.

source: དེ་དག་ཐམས་ཅད་ཆོས་འདོད་པ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་།
en: They desired the Dharma and pursued the Dharma.

source: འདི་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུ་གཏོགས་པའི་ཆོས་རྣམས་ཡང་དག་པར་བསྡུ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་ཕྱིར་འབྲང་བ་དེ་དག །བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Thus, in order to emulate the Bhagavān himself and attain all the qualities included within awakening, they went to where the Bhagavān was staying. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་ཡུལ་བན་ཙ་ནས་རྒྱལ་ཕྲན་ཟླ་བ་སྐྱོངཞེས་བྱ་བ་རང་གི་བློན་པོ་ཆེན་པོ་དང་། གྲོང་ཁྱེར་གྱི་དཔོན་པོ་སྟོང་བསླབ་པའི་གཞི་ལྔ་བླངས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: At that time, there was also Candragupta, the prince of Pañcāla, together with his great ministers and a thousand city chieftains. They had all received the five precepts and had set out toward unsurpassed, complete, and perfect awakening.

source: ཡང་དེའི་ཚེ་ཡུལ་ཆེན་པོ་བཅུ་དྲུག་གི་གྲོང་ཁྱེར་དང་། ཚོང་རྡལ་དང་། ལུང་པའི་མདོ་དང་། གྲོང་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་ཀྱི་མི་རྣམས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བའི་ཕྱིར་ལྷགས་ཏེ།
en: At that time, all the people of the cities, villages, districts, hamlets, provinces, and capitals of all the sixteen great kingdoms had visions of the Bhagavān and went to pay their respects to him.

source: དེ་དག་ཐམས་ཅད་ཀྱང་དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བ། བསླབ་པའི་གཞི་ལྔ་བླངས་པ།
en: They were guardians of the excellent Dharma, having received the five precepts.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་སྟེ།
en: They had all set out toward unsurpassed, complete, and perfect awakening;

source: ཆོས་འདོད་པ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་།
en: they desired the Dharma and pursued the Dharma.

source: འདི་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་བསྡུ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་ཕྱིར་འབྲང་བ། བྱམས་པའི་སེམས་སྒོམ་པ་དེ་དག་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Thus, in order to emulate the Bhagavān himself and attain all the qualities included within awakening, they cultivated the mind of loving-kindness, and after noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་བཙུན་མོ་ཕྲེང་ལྡན་མ་ལ་སོགས་པ་ཆུང་མའི་འཁོར་དང་། བཙུན་མོ་ཁྲི་དྲུག་སྟོང་དང་། གཞན་ཡང་རང་གི་བློན་པོ་ཆེན་པོའི་བཙུན་མོ་འབུམ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also sixteen thousand queens such as Queen Mallikā and others, attended by their retinues of ladies, together with a hundred thousand wives of great ministers. After noon, they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་དགེ་བསྙེན་མ་ས་ག་དགེ་བསྙེན་མ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there were also hundreds of thousands of laywomen who set forth from their respective abodes after noon and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they prostrated, touching their heads to his feet, circumambulated the Bhagavān three times, and sat down to one side.

source: ཡང་དེའི་ཚེ་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་ལྷའི་བུ་རྫུ་འཕྲུལ་དང་སྣང་བ་ཆེན་པོ་དང་ལྡན་པ་འབུམ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: At that time, there was also Maheśvara together with hundreds of thousands of devaputras, all endowed with supernormal powers and great appearances. After noon, they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས།
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times.

source: མེ་ཏོག་གི་ཕུར་མ་རི་རབ་ཙམ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་བ་དང་། བྱུག་པ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ནས་བདུག་པ་དག་གིས་ཡོངས་སུ་བདུགས་ཏེ།
en: They made offerings of flower blossoms in quantities as large as Mount Meru, as well as incense, flower garlands, and ointments, all of which they scattered over the Tathāgata.

source: ཙན་དན་གྱི་ཕྱེ་མ་དག་གིས་ཡོངས་སུ་གཏོར་ནས་སིལ་སྙན་དག་བརྡུངས་ཏེ། གཞན་ཡང་ཤིང་རྟའི་འཕང་ལོ་ཙམ་གྱི་པད་མའི་སིལ་མ་དག་གིས་ཁེབས་པར་བྱས་ནས།
en: Burning incenses, scattering colored powders, and striking cymbals, they proceeded to cover the Tathāgata with lotus flowers the size of chariot wheels.
